modules/common/src/test/resources/com/l7tech/common/resources/dotNetSignedAndEncryptedUsingDKFromSCT.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"><soap:Header><wsa:Action wsu:Id="Id-f6de0fa8-2b5c-4431-a2ba-61eaa70dcee5">http://warehouse.acme.com/ws/listProducts</wsa:Action><wsa:MessageID wsu:Id="Id-24917435-6963-4493-8dc6-26a47c61a3a1">uuid:53769168-b237-4cb3-be1e-643dc17f9275</wsa:MessageID><wsa:ReplyTo wsu:Id="Id-84195fd5-79e4-474d-8c1a-d3c29f759cd5"><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To wsu:Id="Id-bc67f149-e032-4b16-838b-279a9d9d80d9">http://riker:8888/ACMEWarehouseWS/Service1.asmx</wsa:To><wsse:Security><wsu:Timestamp wsu:Id="Timestamp-4559d223-a3b4-42e5-b5b5-c484f7a6bcb3"><wsu:Created>2004-08-03T22:55:15Z</wsu:Created><wsu:Expires>2004-08-03T23:00:15Z</wsu:Expires></wsu:Timestamp><wssc:SecurityContextToken wsu:Id="SecurityToken-50ac5fdf-b1cf-4996-b2d7-077f6e4f5a0e" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wssc:Identifier>uuid:5e78f6fc-bf05-43de-9710-b885d5187f8e</wssc:Identifier></wssc:SecurityContextToken><wssc:DerivedKeyToken wsu:Id="SecurityToken-ab0577b7-cbed-468e-8980-a62a2c970052" wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wsse:SecurityTokenReference><wsse:Reference URI="uuid:5e78f6fc-bf05-43de-9710-b885d5187f8e" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct" /></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>WS-SecureConversation</wssc:Label><wsse:Nonce>5zIc5sVkvSzZgDcB98G9qg==</wsse:Nonce></wssc:DerivedKeyToken><wssc:DerivedKeyToken wsu:Id="SecurityToken-a25efbb7-e564-4397-a0f9-a470a4358bde" wssc:Algorithm="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk/p_sha1" xmlns:wssc="http://schemas.xmlsoap.org/ws/2004/04/sc"><wsse:SecurityTokenReference><wsse:Reference URI="uuid:5e78f6fc-bf05-43de-9710-b885d5187f8e" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/sct" /></wsse:SecurityTokenReference><wssc:Generation>0</wssc:Generation><wssc:Length>16</wssc:Length><wssc:Label>WS-SecureConversation</wssc:Label><wsse:Nonce>mh9fNSRNMT6QTlyW7ovZnQ==</wsse:Nonce></wssc:DerivedKeyToken><xenc:ReferenceList xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:DataReference URI="#EncryptedContent-3574ff4e-ad07-4179-acd2-cfc4f61a9c41" /></xenc:ReferenceList><Signature xmlns="http://www.w3.org/2000/09/xmldsig#"><SignedInfo><CanonicalizationMethod Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /><SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#hmac-sha1" /><Reference URI="#Id-f6de0fa8-2b5c-4431-a2ba-61eaa70dcee5"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>uiKmJaxS4rMVMBOFQnJDBX7yBWY=</DigestValue></Reference><Reference URI="#Id-24917435-6963-4493-8dc6-26a47c61a3a1"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>9Ot/4ZR2VthuqSt7H2dH9sbq5Uw=</DigestValue></Reference><Reference URI="#Id-84195fd5-79e4-474d-8c1a-d3c29f759cd5"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>byiBss1d7sq4yITfJdEWquACa9w=</DigestValue></Reference><Reference URI="#Id-bc67f149-e032-4b16-838b-279a9d9d80d9"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>VYuBeB4z97O2+PUZmoc/DH1IQaY=</DigestValue></Reference><Reference URI="#Timestamp-4559d223-a3b4-42e5-b5b5-c484f7a6bcb3"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>hV2B/84/W5z9cbpMwrRol9Bz/AI=</DigestValue></Reference><Reference URI="#Id-3302a94e-b369-44ca-95ec-bc597c8da05c"><Transforms><Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" /></Transforms><DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" /><DigestValue>vv3xPqJ6tuleRsGA1IzPoGjEMFI=</DigestValue></Reference></SignedInfo><SignatureValue>R1btKZMSrOUOZgcyGWRj5tB9RIM=</SignatureValue><KeyInfo><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-ab0577b7-cbed-468e-8980-a62a2c970052" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk" /></wsse:SecurityTokenReference></KeyInfo></Signature></wsse:Security></soap:Header><soap:Body wsu:Id="Id-3302a94e-b369-44ca-95ec-bc597c8da05c"><xenc:EncryptedData Id="EncryptedContent-3574ff4e-ad07-4179-acd2-cfc4f61a9c41" Type="http://www.w3.org/2001/04/xmlenc#Content" xmlns:xenc="http://www.w3.org/2001/04/xmlenc#"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#aes128-cbc" /><KeyInfo xmlns="http://www.w3.org/2000/09/xmldsig#"><wsse:SecurityTokenReference><wsse:Reference URI="#SecurityToken-a25efbb7-e564-4397-a0f9-a470a4358bde" ValueType="http://schemas.xmlsoap.org/ws/2004/04/security/sc/dk" /></wsse:SecurityTokenReference></KeyInfo><xenc:CipherData><xenc:CipherValue>HqjdcIaZZWk4ieGhUa6aCABv0hoQ6iqLodNVmi2BRt4ZxXTCi8lQGAlZlPZ16FsiCJYTBn4CXXOai+n0zpGrjBucFEeFGweQ+LEV51oMqtg=</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></soap:Body></soap:Envelope>